grouper-ws/grouper-ws/doc/xmlExamples/findStemsSoapRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
  <soapenv:Body>
    <ns1:findStems xmlns:ns1="http://webservices.grouper.middleware.internet2.edu/xsd">
      <ns1:stemName>aStem</ns1:stemName>
      <ns1:parentStemName></ns1:parentStemName>
      <ns1:parentStemNameScope></ns1:parentStemNameScope>
      <ns1:stemUuid></ns1:stemUuid>
      <ns1:queryTerm></ns1:queryTerm>
      <ns1:querySearchFromStemName></ns1:querySearchFromStemName>
      <ns1:queryScope></ns1:queryScope>
    </ns1:findStems>
  </soapenv:Body>
</soapenv:Envelope>